# https://github.com/jacobbednarz/j/blob/main/config/homebrew/Brewfile

tap "aws/tap"
tap "azure/functions"
tap "go-delve/delve"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mkchoi212/fac", "https://github.com/mkchoi212/fac.git"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"
tap "rs/tap"
tap "shopify/shopify"

brew "act"
brew "actionlint"
brew "adr-tools"
brew "ag"
brew "asdf", args: ["HEAD"]
brew "awscli"
brew "azure-cli"
brew "azure-functions-core-tools@4"
brew "bash"
brew "bash-completion@2"
brew "bat"
#brew "broot"
brew "binutils"
brew "cfssl"
brew "cheat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
#brew "docker-compose"
#brew "docker"
brew "duf"
brew "exa"
brew "fac"
brew "fd"
brew "findutils"
brew "fping"
brew "fx"
brew "gh"
brew "git"
brew "gpg2"
brew "gawk"
#brew "git-crypt"
#brew "gitleaks"
#brew "gobuffalo/tap/buffalo"
brew "gnu-sed"
brew "gnu-tar"
brew "graphviz"
brew "grpcurl"
brew "htop"
brew "httpie"
#brew "icdiff"
brew "iftop"
brew "ipcalc"
brew "jid"
brew "jq"
#brew "jupyter"
brew "keychain"
#brew "kube-ps1"
#brew "kubectx"
brew "kubernetes-cli"
#brew "libpq"
brew "lua"
brew "mas"
brew "mdcat"
#brew "minikube"
brew "mssql-tools"
brew "mtr"
brew "neovim"
brew "nmap"
brew "ngrep"
#brew "node"
brew "packer"
brew "pinentry-mac"
brew "postgresql"
brew "pre-commit"
brew "protobuf"
brew "psgrep"
brew "pstree"
brew "python"
#brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rs/tap/dnstrace"
# TODO: https://gist.github.com/emmakat/2226e3e5bc94678da77ba7a62c93a9e2
#brew "secretive"
brew "shellcheck"
brew "shopify/shopify/toxiproxy"
brew "sshuttle"
#brew "siege"
brew "socat"
#brew "speedtest-cli"
#brew "stern"
#brew "stress-ng"
brew "sysbench"
#brew "sysdig" # no m1 support
brew "telnet"
brew "terraform-docs"
brew "tflint"
#brew "tig"
brew "tldr"
brew "tree"
brew "tmux"
brew "tmux-mem-cpu-load"
#brew "tmuxinator"
brew "upx"
#brew "vegeta"
brew "vim"
brew "wakatime-cli"
brew "watch"
brew "wget"
brew "whalebrew"
brew "whois"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "yq"

cask "1password-cli"
cask "1password"
cask "alfred"
#cask "altair-graphql-client"
cask "amazon-chime"
cask "appcleaner"
#cask "brave-browser"
cask "blockblock"
cask "bloomrpc"
#cask "burp-suite" # owasp
#cask "ccmenu" # waypoint?
cask "charles"
#cask "cleanshot" # screenflow
cask "discord"
#cask "daisydisk"
cask "dash"
#cask "deckset" # neat
cask "docker"
cask "element"
cask "firefox"
cask "flux"
#cask "fork"
#cask "gas-mask"
cask "google-chrome-canary"
cask "google-cloud-sdk"
#cask "gpg-suite"
#cask "graphiql"
cask "hashicorp/tap/hashicorp-boundary-desktop"
cask "http-toolkit"
cask "iterm2-beta"
#cask "kaleidoscope"
cask "karabiner-elements"
cask "keybase"
cask "knockknock"
cask "little-snitch"
cask "microsoft-edge"
cask "muzzle"
cask "ngrok"
cask "oversight"
#cask "owasp-zap"
#cask "paw"
cask "postico"
cask "postman"
cask "proxyman"
#cask "rectangle""
cask "reikey"
cask "screenflow"
cask "sequel-pro"
cask "slack"
cask "sloth"
cask "signal"
cask "spotify"
cask "sysdig-inspect"
cask "tableplus"
cask "taskexplorer"
cask "tor-browser"
cask "vagrant"
#cask "vagrant-vmware-utility"
cask "vlc"
#cask "virtualbox" # no m1 support
cask "visual-studio-code-insiders"
#cask "vmware-fusion"
cask "whatsapp"
cask "whatsyoursign"
cask "wireshark"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
