# There's probably some new cool stuff I should check out at
# https://github.com/jacobbednarz/j/blob/main/config/homebrew/Brewfile

tap "aws/tap"
tap "azure/functions"
tap "blendle/blendle"
tap "clok/sm"
tap "common-fate/granted"
#tap "dapr/tap"
tap "fluxcd/tap"
#tap "getsentry/tools"
tap "go-delve/delve"
tap "hashicorp/tap"
#tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "humanlogio/homebrew-tap"
tap "lucagrulla/tap"
tap "inkdrop-org/inkdrop-visualizer"
tap "mkchoi212/fac", "https://github.com/mkchoi212/fac.git"
tap "microsoft/mssql-release", "https://github.com/Microsoft/homebrew-mssql-release"
tap "mutagen-io/mutagen"
tap "rs/tap"
tap "shopify/shopify"

#brew "act"
#brew "actionlint"
#brew "adr-tools"
brew "ag"
brew "argocd"
#brew "asdf", args: ["HEAD"]
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
#brew "azure-functions-core-tools@4"
brew "bash"
brew "bash-completion@2"
#brew "bat"
#brew "broot"
brew "binutils"
brew "btop"
brew "cfssl"
brew "cheat"
brew "cloc"
brew "cloud-provider-kind"
brew "cmake"
#brew "cookiecutter"
brew "coreutils"
brew "ctags"
brew "ctlptl"
brew "curl", link: true, force: true, args: ["HEAD"]
brew "cw"
#brew "dapr-cli" # arch -arm64 brew install dapr/tap/dapr-cli
brew "dasel"
brew "diffutils"
brew "direnv"
brew "dive"
#brew "docker-compose"
brew "docker"
brew "dua-cli"
#brew "duckdb"
#brew "duf"
#brew "entr"
brew "exa"
#brew "exercism"
brew "fac"
brew "fd"
brew "findutils"
#brew "flyctl"
brew "fping"
brew "fluxcd/tap/flux"
brew "fx"
brew "fzf"
brew "gawk"
#brew "getsentry/tools/sentry-cli"
brew "gh"
brew "git"
brew "gpg2"
#brew "git-crypt"
brew "git-flow"
#brew "gitleaks"
brew "glances"
#brew "glow"
#brew "gobuffalo/tap/buffalo"
#brew "gomplate"
#brew "goreleaser"
brew "granted"
brew "gnu-sed"
brew "gnu-tar"
#brew "graphviz"
brew "grpcurl"
brew "hey"
brew "htop"
brew "httpie"
#brew "humanlog"
#brew "hyperfine"
#brew "icdiff"
brew "iftop"
brew "ipcalc"
brew "iperf3"
brew "inkdrop-visualizer"
#brew "irssi"
#brew "jid"
brew "jless"
brew "jo"
brew "jq"
#brew "jupyter"
brew "k9s"
brew "kaskade"
brew "keychain"
brew "kind"
brew "kns"
brew "kube-ps1"
brew "kubectx"
brew "kubie"
#brew "int128/kubelogin/kubelogin"
brew "kubernetes-cli"
brew "lazygit"
brew "lazyjournal"
#brew "libpq"
brew "localstack/tap/localstack-cli"
brew "llm"
brew "lua"
brew "mas"
brew "mdcat"
brew "mike-engel/jwt-cli/jwt-cli"
#brew "minikube"
#brew "mssql-tools"
brew "mtr"
brew "mutagen-io/mutagen/mutagen"
brew "neovim"
brew "nmap"
brew "ngrep"
#brew "node"
brew "openssl"
#brew "openssl-devel"
#brew "packer"
brew "pinentry-mac"
brew "postgresql@14"
brew "pre-commit"
#brew "protobuf"
#brew "protoc-gen-go"
#brew "protoc-gen-go-grpc"
brew "psgrep"
brew "pstree"
brew "python"
#brew "pv"
brew "qemu"
#brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rs/tap/dnstrace"
brew "s3cmd"
brew "scc"
# TODO: https://gist.github.com/emmakat/2226e3e5bc94678da77ba7a62c93a9e2
#brew "secretive"
brew "shellcheck"
brew "shfmt"
#brew "shopify/shopify/toxiproxy"
#brew "siege"
brew "sm"
brew "socat"
#brew "speedtest-cli"
brew "sshuttle"
brew "stern"
#brew "stress-ng"
#brew "sysbench"
#brew "sysdig" # no m1 support
brew "telnet"
#brew "terraform-docs"
#brew "tflint"
#brew "tig"
brew "tilt"
brew "tldr"
brew "tree"
brew "tmux"
brew "tmux-mem-cpu-load"
#brew "tmuxinator"
#brew "upx"
brew "uv"
#brew "vegeta"
#brew "vim"
#brew "vlt"
#brew "wader/tap/fq"
brew "wakatime-cli"
brew "watch"
brew "wget"
#brew "whalebrew"
brew "whois"
brew "yamllint"
brew "yarn"
#brew "youtube-dl"
#brew "yt-dlp"
brew "yq"
brew "xq"

#cask "1password"
cask "1password-cli"
#cask "alfred"
#cask "altair-graphql-client"
#cask "amazon-chime"
#cask "appcleaner"
#cask "authy"
#cask "balenaetcher"
#cask "blockblock"
#cask "bloomrpc"
#cask "brave-browser"
cask "bruno"
#cask "burp-suite" # owasp
#cask "ccmenu" # waypoint?
#cask "charles"
#cask "cleanshot" # screenflow
cask "cursor"
cask "discord"
#cask "daisydisk"
#cask "dash"
#cask "deckset" # neat
#cask "docker"
cask "drawio"
#cask "element"
#cask "firefox"
cask "flux"
#cask "fork"
cask "font-jetbrains-mono-nerd-font"
#cask "gas-mask"
#cask "google-chrome"
#cask "google-chrome-canary"
#cask "google-cloud-sdk"
#cask "gpg-suite"
#cask "graphiql"
#cask "hashicorp/tap/hashicorp-boundary-desktop"
#cask "hiddenbar"
cask "http-toolkit"
cask "insomnia"
#cask "iterm2-beta"
cask "jordanbaird-ice"
#cask "kaleidoscope"
cask "kap"
cask "karabiner-elements"
cask "keybase"
cask "knockknock"
cask "little-snitch"
#cask "lm-studio"
#cask "microsoft-edge"
cask "multipass"
cask "muzzle"
cask "nosql-workbench"
#cask "ngrok"
#cask "obsidian"
#cask "orbstack"
cask "oversight"
#cask "owasp-zap"
#cask "paw"
cask "pgadmin4"
cask "podman-desktop"
#cask "postico"
cask "postman"
#cask "proxyman"
#cask "rectangle"
#cask "redisinsight"
#cask "reikey"
#cask "screenflow"
cask "sequel-pro"
cask "session-manager-plugin"
cask "slack"
#cask "sloth"
#cask "signal"
#cask "spotify"
#cask "sysdig-inspect"
cask "tableplus"
cask "tailscale"
#cask "taskexplorer"
#cask "temurin"
#cask "tor-browser"
#cask "vagrant"
#cask "vagrant-vmware-utility"
cask "vlc"
#cask "virtualbox" # no m1 support
#cask "visual-studio-code"
#cask "visual-studio-code-insiders"
#cask "vmware-fusion"
cask "whatsapp"
#cask "whatsyoursign"
cask "wireshark"
#cask "xquartz"
#cask "yubico-yubikey-manager"
#cask "zoom"

mas "Amphetamine", id: 937984704
mas "Clocker", id: 1056643111
mas "GIPHY Capture", id: 668208984
#mas "Hidden Bar", id: 1452453066
mas "Magnet", id: 441258766
mas "UTC Time", id: 1538245904
mas "WireGuard", id: 1451685025
